BojanJurca/Esp32_oscilloscope/httpServer.hpp
        string readString () { // reads String that arrived from browser (it is a calling program responsibility to check if data type is text)
                               // returns "" in case of communication error
          while (true) {
            switch (available ()) {
              case WebSocket::NOT_AVAILABLE:  delay (1);
                                              break;
              case WebSocket::STRING:         { 
                                                string s ((char *) __readBuffer__); 
                                                __readFrameState__ = EMPTY;
                                                return s;
                                              }
              default:                        return ""; // WebSocket::BINARY, WebSocket::ERROR, WebSocket::CLOSE, WebSocket::TIME_OUT
            }                                                    
          }
        }

        size_t binarySize () { return __readFrameState__ == FULL ? __readBufferSize__ : 0; } // returns how many bytes has arrived from browser, 0 if data is not ready (yet) to be read
                                                    
        size_t readBinary (byte *buffer, size_t bufferSize) { // returns number bytes copied into buffer
                                                              // returns 0 if there is not enough space in buffer or in case of communication error
          while (true) {
            switch (available ()) {
              case WebSocket::NOT_AVAILABLE:  delay (1);
                                              break;
              case WebSocket::BINARY:         { 
                                                size_t l = binarySize ();
                                                if (bufferSize >= l) 
                                                  memcpy (buffer, __readBuffer__, l);
                                                else
                                                  l = 0;
                                                __readFrameState__ = EMPTY;
                                                return l; 
                                              }
              default:                        return 0; // WebSocket::STRING WebSocket::ERROR, WebSocket::CLOSE, WebSocket::TIME_OUT
            }                                                    
          }
        }

        bool sendString (char *text) { return __sendFrame__ ((byte *) text, strlen (text), WebSocket::STRING); } // returns success

        bool sendString (const char *text) { return __sendFrame__ ((byte *) text, strlen (text), WebSocket::STRING); } // returns success
                                                  
        bool sendBinary (byte *buffer, size_t bufferSize) { return __sendFrame__ (buffer, bufferSize, WebSocket::BINARY); } // returns success
        
      private:

        STATE_TYPE __state__ = NOT_RUNNING;

        unsigned long __lastActive__ = millis (); // time-out detection

        int __connectionSocket__ = -1;
        char *__wsRequest__ = NULL;
        char *__clientIP__ = NULL;
        char *__serverIP__ = NULL;

        bool __sendFrame__ (byte *buffer, size_t bufferSize, WEBSOCKET_DATA_TYPE dataType) { // returns true if frame has been successfully sent 
          if (bufferSize > 0xFFFF) { // this size fits in large frame size - not supported
            dmesg ("[WebSocket] large frame size is not supported");
            closeWebSocket ();
            return false;                         
          } 
          // byte *frame = NULL;
          if (bufferSize > HTTP_WS_FRAME_MAX_SIZE - 4) { // 4 bytes are needed for header
            dmesg ("[WebSocket] frame size > ", HTTP_WS_FRAME_MAX_SIZE - 4, (char *) "is not supported");
            closeWebSocket ();
            return false;                         
          }           
          byte sendFrame [HTTP_WS_FRAME_MAX_SIZE];
          int sendFrameSize;
          if (bufferSize > 125) { // medium frame size
            // if (!(frame = (byte *) malloc (frameSize = 4 + bufferSize))) { // 4 bytes for header (without mask) + payload
            //   dmesg ("[WebSocket] __sendFrame__ malloc error (out of memory)");
            //   closeWebSocket ();
            //   return false;
            // }
            // frame type
            sendFrame [0] = 0b10000000 | dataType; // set FIN bit and frame data type
            sendFrame [1] = 126; // medium frame size, without masking (we won't do the masking, won't set the MASK bit)
            sendFrame [2] = bufferSize >> 8; // / 256;
            sendFrame [3] = bufferSize; // % 256;
            memcpy (sendFrame + 4, buffer, bufferSize);  
            sendFrameSize = bufferSize + 4;
          } else { // small frame size
            // if (!(frame = (byte *) malloc (frameSize = 2 + bufferSize))) { // 2 bytes for header (without mask) + payload
            //   dmesg ("[WebSocket] __sendFrame__ malloc error (out of memory)");
            //   closeWebSocket ();
            //   return false;
            // }
            sendFrame [0] = 0b10000000 | dataType; // set FIN bit and frame data type
            sendFrame [1] = bufferSize; // small frame size, without masking (we won't do the masking, won't set the MASK bit)
            if (bufferSize) memcpy (sendFrame + 2, buffer, bufferSize);  
            sendFrameSize = bufferSize + 2;
          }
          if (sendAll (__connectionSocket__, (char *) sendFrame, sendFrameSize, HTTP_CONNECTION_WS_TIME_OUT) != sendFrameSize) {
            closeWebSocket ();
            return false;
          }
          __lastActive__ = millis (); 
          return true;
        }
    
        enum READ_FRAME_STATE {
          EMPTY = 0,                                  // frame is empty
          READING_SHORT_HEADER = 1,
          READING_MEDIUM_HEADER = 2,
          READING_PAYLOAD = 3,
          FULL = 4                                    // frame is full and waiting to be read by calling program
        }; 
        READ_FRAME_STATE __readFrameState__ = EMPTY;
        byte __readFrame__ [HTTP_WS_FRAME_MAX_SIZE];  // frame consists of a header (6, 8 or 12 bytes (12 only for large frames which are not supported here)) and data payload buffer
        byte *__readBuffer__;                         // pointer to buffer for frame payload - will be directed to __readFrame__ just after the header later
        unsigned int __readBufferSize__;              // size of payload in current frame
        unsigned int __bytesRead__;                   // how many bytes of current buffer have been read so far
        byte *__mask__;                               // pointer to 4 frame mask bytes
    };

    
    // ----- httpConnection class -----

    class httpConnection {

