BojanJurca/Esp32_oscilloscope/httpServer.hpp
      public:

        // httpConnection state
        enum STATE_TYPE {
          NOT_RUNNING = 0, 
          RUNNING = 2        
        };

        STATE_TYPE state () { return __state__; }

        httpConnection ( // the following parameters will be handeled by httpConnection instance
                         int connectionSocket,
                         String (*httpRequestHandlerCallback) (char *httpRequest, httpConnection *hcn), // httpRequestHandler callback function provided by calling program
                         void (*wsRequestHandler) (char *wsRequest, WebSocket *webSocket),              // httpRequestHandler callback function provided by calling program      
                         char *clientIP, char *serverIP
                       )  {
                              // create a local copy of parameters for later use
                              __connectionSocket__ = connectionSocket;
                              __httpRequestHandlerCallback__ = httpRequestHandlerCallback;
                              __wsRequestHandler__ = wsRequestHandler;
                              strncpy (__clientIP__, clientIP, sizeof (__clientIP__)); __clientIP__ [sizeof (__clientIP__) - 1] = 0; // copy client's IP since connection may live longer than the server that created it
                              strncpy (__serverIP__, serverIP, sizeof (__serverIP__)); __serverIP__ [sizeof (__serverIP__) - 1] = 0; // copy server's IP since connection may live longer than the server that created it
                              // handle connection in its own thread (task)       
                              #define tskNORMAL_PRIORITY 1
                              xTaskHandle taskHandle;
                              socketTrafficInformation [connectionSocket - LWIP_SOCKET_OFFSET] = {};
                              if (pdPASS != xTaskCreate (__connectionTask__, "httpConnection", HTTP_CONNECTION_STACK_SIZE, this, tskNORMAL_PRIORITY, &taskHandle)) {
                                  dmesg ("[httpConnection] xTaskCreate error");
                              } else {
                                  __state__ = RUNNING;
                                  socketTrafficInformation [connectionSocket - LWIP_SOCKET_OFFSET].startMillis = millis ();
                              }
                          }

        ~httpConnection ()  {
                              // close connection socket
                              int connectionSocket;
                              xSemaphoreTake (__httpServerSemaphore__, portMAX_DELAY);
                                connectionSocket = __connectionSocket__;
                                __connectionSocket__ = -1;
                              xSemaphoreGive (__httpServerSemaphore__);
                              if (connectionSocket > -1) close (connectionSocket);
                            }

        int getSocket () { return __connectionSocket__; }

        char *getClientIP () { return __clientIP__; }

        char *getServerIP () { return __serverIP__; }

        char *getHttpRequest () { return __httpRequestAndReplyBuffer__; }

        string getHttpRequestHeaderField (char *fieldName) { // HTTP header fields are in format \r\nfieldName: fieldValue\r\n
          char *p = stristr (__httpRequestAndReplyBuffer__, fieldName); 
          if (p && p != __httpRequestAndReplyBuffer__ && *(p - 1) == '\n' && *(p + strlen (fieldName)) == ':') { // p points to fieldName in HTTP request
            p += strlen (fieldName) + 1; while (*p == ' ') p++; // p points to field value in HTTP request
            string s; while (*p >= ' ') s += *(p ++);
            return s;
          }
          return "";
        }

        string getHttpRequestCookie (char *cookieName) { // cookies are passed from browser to http server in "cookie" HTTP header field
          char *p = stristr (__httpRequestAndReplyBuffer__, (char *) "\nCookie:"); // find cookie field name in HTTP header          
          if (p) {
            p = strstr (p, cookieName); // find cookie name in HTTP header
            if (p && p != __httpRequestAndReplyBuffer__ && *(p - 1) == ' ' && *(p + strlen (cookieName)) == '=') {
              p += strlen (cookieName) + 1; while (*p == ' ' || *p == '=' ) p++; // p points to cookie value in HTTP request
              string s; while (*p > ' ' && *p != ';') s += *(p ++);
              return s;
            }
          }
          return "";
        }

        void setHttpReplyStatus (char *status) { strncpy (__httpReplyStatus__, status, HTTP_REPLY_STATUS_MAX_LENGTH); __httpReplyStatus__ [HTTP_REPLY_STATUS_MAX_LENGTH - 1] = 0; }
        
        void setHttpReplyHeaderField (string fieldName, string fieldValue) { 
            __httpReplyHeader__ += fieldName;
            __httpReplyHeader__ +=  + ": ";
            __httpReplyHeader__ += fieldValue;
            __httpReplyHeader__ += "\r\n"; 
        }

        void setHttpReplyCookie (string cookieName, string cookieValue, time_t expires = 0, string path = "/") { 
          char e [50] = "";
          if (expires) {
              if (!time ()) { // time not set
                  dmesg ("[httpConnection] could not set cookie expiration time since the current time has not been set yet");
                  return;
              }
              struct tm st = gmTime (expires);
              strftime (e, sizeof (e), "; Expires=%a, %d %b %Y %H:%M:%S GMT", &st);
          }
          // save whole fieldValue into cookieName to save stack space
          cookieName += "=";
          cookieName += cookieValue;
          cookieName += "; Path=";
          cookieName += path;
          cookieName += e;
          setHttpReplyHeaderField ("Set-Cookie", cookieName);
        }

        // combination of clientIP and User-Agent HTTP header field - used for calculation of web session token
        String getClientSpecificInformation () { return String (__clientIP__) + getHttpRequestHeaderField ((char *) "User-Agent"); }
                                                                                                                
