BojanJurca/Esp32_oscilloscope/httpServer.hpp
                        // if Content-type was not provided during __httpRequestHandlerCallback__ try guessing what it is
                        if (!stristr ((char *) ths->__httpReplyHeader__.c_str (), (char *) "CONTENT-TYPE")) { 
                               if (fileName.endsWith ((char *) ".bmp"))                                         ths->setHttpReplyHeaderField ("Content-Type", "image/bmp");
                          else if (fileName.endsWith ((char *) ".css"))                                         ths->setHttpReplyHeaderField ("Content-Type", "text/css");
                          else if (fileName.endsWith ((char *) ".csv"))                                         ths->setHttpReplyHeaderField ("Content-Type", "text/csv");
                          else if (fileName.endsWith ((char *) ".gif"))                                         ths->setHttpReplyHeaderField ("Content-Type", "image/gif");
                          else if (fileName.endsWith ((char *) ".htm") || fileName.endsWith ((char *) ".html")) ths->setHttpReplyHeaderField ("Content-Type", "text/html");
                          else if (fileName.endsWith ((char *) ".jpg") || fileName.endsWith ((char *) ".jpeg")) ths->setHttpReplyHeaderField ("Content-Type", "image/jpeg");
                          else if (fileName.endsWith ((char *) ".js"))                                          ths->setHttpReplyHeaderField ("Content-Type", "text/javascript");
                          else if (fileName.endsWith ((char *) ".json"))                                        ths->setHttpReplyHeaderField ("Content-Type", "application/json");
                          else if (fileName.endsWith ((char *) ".mpeg"))                                        ths->setHttpReplyHeaderField ("Content-Type", "video/mpeg");
                          else if (fileName.endsWith ((char *) ".pdf"))                                         ths->setHttpReplyHeaderField ("Content-Type", "application/pdf");
                          else if (fileName.endsWith ((char *) ".png"))                                         ths->setHttpReplyHeaderField ("Content-Type", "image/png");
                          else if (fileName.endsWith ((char *) ".tif") || fileName.endsWith ((char *) ".tiff")) ths->setHttpReplyHeaderField ("Content-Type", "image/tiff");
                          else if (fileName.endsWith ((char *) ".txt"))                                         ths->setHttpReplyHeaderField ("Content-Type", "text/plain");
                          // ... add more if needed but Contet-Type can often be omitted without problems ...
                        }
                  
                        File f = fileSystem.open (fileName, "r", false);           
                        if (f) {
                          if (!f.isDirectory ()) {

                            diskTrafficInformation.bytesRead += f.size (); // asume the whole file will be read - update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                            if (ths->__httpReplyHeader__.error ()) {
                                dmesg ("[httpConnection] __httpReplyHeader__ too small for HTTP reply header");
                                sendAll (ths->__connectionSocket__, (char *) reply507, HTTP_CONNECTION_TIME_OUT);
                                goto endOfConnection;
                            }
                            // construct the whole HTTP reply from differrent pieces and send it to client (browser)
                            // if the reply is short enough send it in one block, 
                            // if not send header first and then the content, so we won't have to move hughe blocks of data
                            unsigned long httpReplyContentLen = f.size ();

                            ths->__httpRequestAndReplyBuffer__ = "";
                            ths->__httpRequestAndReplyBuffer__ += "HTTP/1.1 ";
                            ths->__httpRequestAndReplyBuffer__ += ths->__httpReplyStatus__;
                            ths->__httpRequestAndReplyBuffer__ += "\r\n";
                            ths->__httpRequestAndReplyBuffer__ += ths->__httpReplyHeader__;
                            ths->__httpRequestAndReplyBuffer__ += "Content-Length: ";
                            ths->__httpRequestAndReplyBuffer__ += httpReplyContentLen; 
                            ths->__httpRequestAndReplyBuffer__ += "\r\n\r\n";
                            // DEBUG: Serial.printf ("(%s)", ths->__httpRequestAndReplyBuffer__);

                            unsigned long httpReplyHeaderLen = ths->__httpRequestAndReplyBuffer__.length ();

                            // can not happen due to the difference in lengths, we can skip checking:
                            // if (ths->__httpRequestAndReplyBuffer__.error ()) {
                            //    dmesg ("[httpConnection] __httpRequestAndReplyBuffer__ too small");
                            //    sendAll (ths->__connectionSocket__, reply507, HTTP_CONNECTION_TIME_OUT);
                            //    goto endOfConnection;
                            // }

                            int bytesToReadThisTime = min (httpReplyContentLen, (unsigned long) HTTP_BUFFER_SIZE - httpReplyHeaderLen); 
                            int bytesReadThisTime = f.read ((uint8_t *) &ths->__httpRequestAndReplyBuffer__ [httpReplyHeaderLen], (unsigned long) bytesToReadThisTime);
                            ths->__httpRequestAndReplyBuffer__ [HTTP_BUFFER_SIZE] = 0;
                            if (!bytesToReadThisTime || sendAll (ths->__connectionSocket__, ths->__httpRequestAndReplyBuffer__, httpReplyHeaderLen + bytesReadThisTime, HTTP_CONNECTION_TIME_OUT) <= 0) {
                              dmesg ("[httpConnection] read-send error: ", errno, strerror (errno));
                              f.close ();
                              goto endOfConnection;
                            }
                            // DEBUG: Serial.printf ("first packet from the file: %i bytes\n|%s|\n\n", httpReplyHeaderLen + bytesReadThisTime, ths->__httpRequestAndReplyBuffer__);
                            int bytesSent = bytesReadThisTime; // already sent
                            while (bytesSent < httpReplyContentLen) {
                              bytesToReadThisTime = min (httpReplyContentLen - bytesSent, (unsigned long) HTTP_BUFFER_SIZE);
                              bytesReadThisTime = f.read ((uint8_t *) &ths->__httpRequestAndReplyBuffer__ [0], (unsigned long) bytesToReadThisTime);
                              if (!bytesToReadThisTime || sendAll (ths->__connectionSocket__, ths->__httpRequestAndReplyBuffer__, bytesReadThisTime, HTTP_CONNECTION_TIME_OUT) <= 0) {
                                dmesg ("[httpConnection] read-send error: ", errno, strerror (errno));
                                f.close ();
                                goto endOfConnection;
                              }                    
                              // DEBUG: Serial.printf ("next packet from the file: %i bytes\n", bytesReadThisTime);
                              bytesSent += bytesReadThisTime; // already sent
                            }
                            // DEBUG: Serial.printf ("[httpConnection] reply length: %i\n", bytesSent);
                            // HTTP reply sent
                            f.close ();
                            goto nextHttpRequest;
                          } // if file is a file, not a directory
                          f.close ();
                        } // if file is open
                      }   
                    }          
                  }
                #endif
  
                // SEND 404 HTTP REPLY SEND 404 HTTP REPLY SEND 404 HTTP REPLY SEND 404 HTTP REPLY SEND 404 HTTP REPLY SEND 404 HTTP REPLY
  
                if (sendAll (ths->__connectionSocket__, (char *) reply404, strlen (reply404), HTTP_CONNECTION_TIME_OUT) <= 0) {
                  dmesg ("[httpConnection] send error: ", errno, strerror (errno));
                  goto endOfConnection;
                }
  
        nextHttpRequest:
              // search for Keep-alive directive if the client wants to keep the connection alive for subsequent requests
              char *p = stristr (ths->__httpRequestAndReplyBuffer__, (char *) "CONNECTION: KEEP-ALIVE");
              if (p && p < endOfHttpRequest) {
                  keepAlive = true;
                  strcpy (ths->__httpRequestAndReplyBuffer__, endOfHttpRequest + 4);
                  receivedTotal = strlen (ths->__httpRequestAndReplyBuffer__);
                  // restore default values of member variables for the next HTTP request on the same TCP connection
                  strcpy (ths->__httpReplyStatus__, "200 OK"); 
                  ths->__httpReplyHeader__ = "";                  
              } else {
                  goto endOfConnection;
              }

            } while (keepAlive); // do while keep-alive   
          } // code block

