BojanJurca/Esp32_oscilloscope/httpServer.hpp
                        socketTrafficInformation [ths->__listeningSocket__ - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();

                        // prepare network Traffic measurement information
                        socketTrafficInformation [connectingSocket - LWIP_SOCKET_OFFSET] = {0, 0};
                        // get client's IP address
                        char clientIP [46]; inet_ntoa_r (connectingAddress.sin_addr, clientIP, sizeof (clientIP)); 
                        // get server's IP address
                        char serverIP [46]; struct sockaddr_in thisAddress = {}; socklen_t len = sizeof (thisAddress);
                        if (getsockname (connectingSocket, (struct sockaddr *) &thisAddress, &len) != -1) inet_ntoa_r (thisAddress.sin_addr, serverIP, sizeof (serverIP));
                        // port number could also be obtained if needed: ntohs (thisAddress.sin_port);
                        if (ths->__firewallCallback__ && !ths->__firewallCallback__ (clientIP)) {
                          dmesg ("[httpServer] firewall rejected connection from ", clientIP);
                          close (connectingSocket);
                        } else {
                          // make the socket non-blocking so that we can detect time-out
                          if (fcntl (connectingSocket, F_SETFL, O_NONBLOCK) == -1) {
                            dmesg ("[httpServer] fcntl error: ", errno, strerror (errno));
                            close (connectingSocket);
                          } else {
                                // create httpConnection instence that will handle the connection, then we can lose reference to it - httpConnection will handle the rest
                                httpConnection *hcp = new (std::nothrow) httpConnection (connectingSocket, ths->__httpRequestHandlerCallback__, ths->__wsRequestHandler__, clientIP, serverIP);
                                if (!hcp) {
                                  // dmesg ("[httpServer] new httpConnection error");
                                  sendAll (connectingSocket, (char *) reply503, strlen (reply503), HTTP_CONNECTION_TIME_OUT);
                                  close (connectingSocket); // normally httpConnection would do this but if it is not created we have to do it here
                                } else {
                                  if (hcp->state () != httpConnection::RUNNING) {
                                    sendAll (connectingSocket, (char *) reply503, strlen (reply503), HTTP_CONNECTION_TIME_OUT);
                                    delete (hcp); // normally httpConnection would do this but if it is not running we have to do it here
                                  }
                                }
                                                               
                          } // fcntl
                        } // firewall
                      } // accept
                      
                  } // while accepting connections
                  dmesg ("[httpServer] stopped");
          
                 } // listen
               } // bind
              } // setsockopt
              int listeningSocket;
              xSemaphoreTake (__httpServerSemaphore__, portMAX_DELAY);
                listeningSocket = ths->__listeningSocket__;
                ths->__listeningSocket__ = -1;
              xSemaphoreGive (__httpServerSemaphore__);
              if (listeningSocket > -1) close (listeningSocket);
            } // socket
            ths->__state__ = NOT_RUNNING;
          }
          // stop the listening thread (task)
          vTaskDelete (NULL); // it is listener's responsibility to close itself          
        }
          
    };


    /*  
       Internal "database" od valid web session tokens  
    */

    class webSessionToken {  
      public:

        char *generateToken (httpConnection *hcn) { // calculates new token from random number and client specific information
          sha256 (__token__, sizeof (__token__), (char *) (String (__randomNumber__) + hcn->getClientSpecificInformation ()).c_str ());
          __lastActive__ = millis ();
          return getToken ();
        }

        bool isTokenValid (httpConnection *hcn) { // checks token validity against client specific information and time-out
          if (millis () - __lastActive__ >= WEB_SESSION_TIME_OUT) return false; // web session token time-out
          if (!*__token__) return false; // web  session token not set
          char token [65];
          sha256 (token, sizeof (token), (char *) (String (__randomNumber__) + hcn->getClientSpecificInformation ()).c_str ());
          if (strcmp (__token__, token)) return false;
          __lastActive__ = millis ();
          return true;
        }

        char *getToken () {
          if (millis () - __lastActive__ >= WEB_SESSION_TIME_OUT) return NULL; // web session token time-out
          if (!*__token__) return NULL; // web  session token not set
          return __token__; // valid web session token
        }

        void deleteToken () { *__token__ = 0; }        

        void setAdditionalInformation (char *additionalInformation) { 
          __lastActive__ = millis ();
          strncpy (__additionalInformation__, additionalInformation, sizeof (__additionalInformation__)); __additionalInformation__ [sizeof (__additionalInformation__) - 1] = 0;
        };

        char *getAdditionalInformation () { 
          __lastActive__ = millis ();
          return __additionalInformation__; 
        };

      private:

        unsigned long __lastActive__;
        char __token__ [65] = {};
        long __randomNumber__ = random (2147483647);

        // any additional information connected to token like user name, ...
        char __additionalInformation__ [WEB_SESSION_TOKENS_ADDITIONAL_INFORMATION_SIZE] = {};
    };  
    
    webSessionToken __webSessionTokens__ [MAX_WEB_SESSION_TOKENS];

    String generateWebSessionToken (httpConnection *hcn) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find free slot
        if (!__webSessionTokens__ [i].getToken ()) {
          return __webSessionTokens__ [i].generateToken (hcn); // success
        }
      }
      return ""; // failure
    }

