BojanJurca/Esp32_oscilloscope/httpServer.hpp
    bool isWebSessionTokenValid  (String token, httpConnection *hcn) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          return __webSessionTokens__ [i].isTokenValid (hcn); // check validity
        }
      }
      return false; // failure
    }

    bool deleteWebSessionToken  (String token) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          __webSessionTokens__ [i].deleteToken (); 
          return true; // success
        }
      }
      return false; // failure
    }

    // any additional information connected to token like user name, ...
    bool setWebSessionTokenAdditionalInformation  (String token, String additionalInformation) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          __webSessionTokens__ [i].setAdditionalInformation ((char *) additionalInformation.c_str ());
          return true;
        }
      }
      return false; // failure
    }

    // any additional information connected to token like user name, ...
    String getWebSessionTokenAdditionalInformation  (String token) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          return __webSessionTokens__ [i].getAdditionalInformation (); 
        }
      }
      return ""; // failure
    }
    
#endif
